{
    "questions": [
        {
            "id": "1",
            "question": "Explain how market analysis, specifically using Porter's Five Forces, helps in creating a go-to-market strategy.",
            "template": "The candidate should first define what a go-to-market strategy is and then explain Porter's Five Forces framework (threat of new entrants, bargaining power of suppliers, bargaining power of buyers, threat of substitute products or services, and rivalry among existing competitors). They should then explain how each of these forces affects a company's ability to successfully enter a new market or improve its position in an existing market, demonstrating an understanding of how these forces inform strategic decisions. The explanation should provide a practical link between the analysis and strategy creation.",
            "criteria": "The candidate's answer should demonstrate a clear understanding of both the go-to-market strategy and Porter's Five Forces. They should explain each of the five forces and provide a practical and coherent explanation of how the framework helps in identifying key risks, opportunities, and strategic considerations that shape a successful go-to-market strategy. The answer should move beyond a superficial definition and into a demonstration of practical application.",
            "category": "Theoretical"
        },
        {
            "id": "2",
            "question": "What is the role of machine learning in creating an optimal diversified portfolio, and how do models like KNN and LSTM contribute to this process?",
            "template": "The candidate should start by explaining the concept of a diversified portfolio and its importance in mitigating risk. They should then explain how machine learning can be used to enhance the portfolio creation process, focusing on tasks like clustering stocks based on similarity, predicting future prices, and optimizing asset allocation. The candidate should further explain the basic functionalities of KNN and LSTM, and how they can be used to solve different tasks (e.g., KNN for clustering and LSTM for time series prediction). The explanation should demonstrate an understanding of how these techniques improve upon traditional methods of portfolio management. They should also mention how these models contribute to making the portfolio more optimised.",
            "criteria": "The candidate must explain the importance of a diversified portfolio and correctly identify the role of machine learning. They should showcase a foundational understanding of KNN and LSTM models, and clarify their respective roles in tasks related to portfolio optimization. The response must be articulate and link the theoretical application of these models with practical value in enhancing the portfolio building process. A correct understanding of how these algorithms work and an explanation of why they are suited for the particular task is essential.",
            "category": "Theoretical"
        },
        {
            "id": "3",
            "question": "Explain the importance of the OECD DAC and the LFA frameworks in setting up an impact assessment system for a non-profit organization.",
            "template": "The candidate should first define what impact assessment is and why it’s important for non-profit organizations. Then, they should explain what OECD DAC criteria (Relevance, Effectiveness, Efficiency, Impact, Sustainability) are and what the Logical Framework Approach (LFA) is (identifying goals, activities, and indicators). The candidate should elaborate on how these frameworks help non-profits structure their assessment processes, ensuring that data is collected systematically and results can be used to improve organizational performance and program design. They should also demonstrate how a structured framework aids in monitoring and evaluating the effectiveness and reach of the interventions of the non-profit organization, demonstrating practical usage of the frameworks.",
            "criteria": "The candidate should correctly identify and explain OECD DAC criteria and the LFA framework. They should effectively connect these frameworks to the process of impact assessment for a non-profit, explaining their practical and strategic relevance. The explanation should reflect a clear understanding of both theoretical concepts and their real-world application in the non-profit sector, demonstrating how the application of these frameworks makes non-profits more accountable, effective and efficient.",
            "category": "Theoretical"
        },
        {
            "id": "4",
            "question": "Explain the difference between a deep copy and a shallow copy in Python, and provide a scenario where using one over the other would be critical in a data engineering context.",
            "template": "The candidate should clearly define deep and shallow copies, referencing memory allocation differences. They should then offer a specific example from data engineering (e.g., copying a complex data structure like a Spark DataFrame) to demonstrate the practical implications of choosing between the two. The explanation should highlight the dangers of unexpected data modification when shallow copying is misused.",
            "criteria": "Correct definition of deep and shallow copy, accurate explanation of memory management, relevant data engineering scenario provided, and understanding of potential pitfalls of shallow copies.",
            "category": "Technical Skills"
        },
        {
            "id": "5",
            "question": "Describe the typical architecture of an ETL (Extract, Transform, Load) process. Detail the specific steps involved and explain the role of data validation and error handling within this process.",
            "template": "The candidate should provide a structured explanation of the ETL process, covering data extraction from various sources, transformation steps (cleaning, standardization, etc.), and the loading into the target system (data warehouse, data lake). They must also discuss the critical role of data validation and error handling mechanisms during each stage.",
            "criteria": "Thorough explanation of all ETL stages, inclusion of data validation, error handling, and a clear understanding of the process flow.",
            "category": "Technical Skills"
        },
        {
            "id": "6",
            "question": "How can you optimize a SQL query that is running slowly, given a table with millions of rows? Provide at least three different optimization techniques.",
            "template": "The candidate should demonstrate knowledge of SQL query optimization techniques. This may include using indexes, rewriting queries to avoid full table scans (e.g. leveraging joins and where clauses correctly), using appropriate data types, and avoiding the use of wildcard searches in `LIKE` clauses, while providing explanations for the choices made.",
            "criteria": "Identification of at least three valid optimization techniques, a clear explanation of how each works, and why it can improve query speed.",
            "category": "Technical Skills"
        },
        {
            "id": "7",
            "question": "What are the key differences between using Hadoop and Spark for processing large datasets, particularly in terms of performance and use cases?",
            "template": "The candidate should discuss the architectural differences between Hadoop (MapReduce) and Spark.  Focus should be placed on in-memory processing for Spark vs. disk-based processing for Hadoop. They should provide use cases where each would be more applicable, while also comparing their speed and performance characteristics.",
            "criteria": "Clear understanding of Hadoop and Spark architectures, accurate comparison of performance, appropriate use cases for each.",
            "category": "Technical Skills"
        },
        {
            "id": "8",
            "question": "Explain the concept of data modeling, and describe at least two different types of data models used in data warehousing.  Provide an example use case for each.",
            "template": "The candidate should provide a clear definition of data modeling and explain why it’s important. They should describe at least two different types of data models (e.g., star schema, snowflake schema) and give examples of use cases, highlighting the tradeoffs of each when it comes to storage and query performance.",
            "criteria": "Correct definition of data modeling, explanation of at least two different models, and an appropriate use case for each, while also mentioning tradeoffs.",
            "category": "Technical Skills"
        },
        {
            "id": "9",
            "question": "Describe how you would set up a data pipeline on a cloud platform like Azure (specifically targeting Databricks), focusing on the key architectural components involved.",
            "template": "The candidate should describe the process of creating a data pipeline on Databricks using a service like Azure Data Factory or Databricks Workflows, detailing the ingestion process from various source systems, the transformations within Databricks, and the final loading into a target database or data lake.  Key architectural components should include the compute resources, data storage, and workflow management aspects.",
            "criteria": "Clear description of Databricks-specific data pipeline architecture including ingestion, transformation and loading, and details on the key components like compute and storage and workflow management.",
            "category": "Technical Skills"
        },
        {
            "id": "10",
            "question": "Explain how you would use Git for version control in a data engineering project. What are the benefits of using a branching strategy?",
            "template": "The candidate should demonstrate an understanding of Git for version control, describing basic commands for versioning, branching, and merging. They should be able to explain the benefits of using a branch-based development workflow (e.g., feature branches, release branches) and how to manage conflicts.",
            "criteria": "Demonstrated knowledge of Git commands, benefits of branching strategies, and knowledge of best practices to manage conflicts.",
            "category": "Technical Skills"
        },
        {
            "id": "11",
            "question": "What are the key security considerations when designing and implementing a data pipeline? Provide at least three specific security best practices you would implement.",
            "template": "The candidate should highlight data security risks and challenges associated with data pipelines, including data at rest, data in transit, access control and compliance. They should then give specific examples like encryption, access control, and masking/tokenizing of sensitive data.",
            "criteria": "Explanation of data security risks, specific security measures, and understanding of their impact on data safety.",
            "category": "Technical Skills"
        },
        {
            "id": "12",
            "question": "What is the purpose of window functions in SQL, and how do they differ from aggregate functions? Give an example of when a window function would be particularly useful in a data analysis scenario.",
            "template": "The candidate should clearly define window functions in SQL and explain their use cases (performing calculations across a set of rows that are related to the current row), how they differ from aggregate functions, while giving an appropriate use case of it.",
            "criteria": "Correct definition of window function, clear differences between aggregate and window functions, and a relevant data analysis scenario using window function.",
            "category": "Technical Skills"
        },
        {
            "id": "13",
            "question": "Describe the process of building a simple LSTM (Long Short-Term Memory) model. What kind of preprocessing techniques are necessary to prepare the data for an LSTM, and what are its applications in data analysis?",
            "template": "The candidate should explain the fundamental architecture of an LSTM and the need of sequence data in training such model, while also describing the key preprocessing techniques for it (e.g., handling missing values, normalization, creating sequence data) and applications in time series data or anomaly detection.",
            "criteria": "Clear understanding of LSTM architecture, necessary preprocessing techniques, and understanding of its applications",
            "category": "Technical Skills"
        },
        {
            "id": "14",
            "question": "Kunaal, you mentioned leading a team of 8 consultants for a go-to-market strategy project. Imagine in a similar future project, your team is split on the best approach for a complex data migration process. How would you facilitate a decision, ensuring all team members feel heard and the project stays on track?",
            "template": "The candidate should describe a structured approach to conflict resolution and decision-making within a team setting. This includes acknowledging diverse perspectives, facilitating open discussion, and moving towards a consensus or a data-driven decision. The candidate should highlight the importance of maintaining the project timeline while addressing team dynamics.",
            "criteria": "The answer should demonstrate strong conflict resolution skills, ability to facilitate decision-making, an emphasis on open communication, and an understanding of project timelines. The candidate should not only focus on reaching a decision but also on ensuring team satisfaction and maintaining a collaborative environment.",
            "category": "Situational"
        },
        {
            "id": "15",
            "question": "Describe a time when you had to present complex technical information to a non-technical audience. What challenges did you encounter, and what strategies did you use to ensure your audience understood the key takeaways?",
            "template": "The candidate should discuss a situation where they had to explain a technical concept to a non-technical audience. They should focus on the challenges of simplifying technical jargon, avoiding overwhelming the audience, and ensuring key takeaways were clear. The answer should also highlight specific strategies like using analogies, visuals, or real-world examples to aid comprehension.",
            "criteria": "The candidate should articulate the importance of tailoring communication to the audience. The answer should demonstrate a strong understanding of communication nuances and the ability to simplify complex topics. Emphasis should be placed on the use of effective communication strategies and the candidate’s ability to measure audience comprehension.",
            "category": "Situational"
        }
    ]
}