{
    "questions": [
        {
            "id": "1",
            "question": "During your Go-to-Market Strategy project, how did you determine the optimal balance between reach and cost when selecting marketing channels for the South African client?",
            "template": "The candidate should describe their process for evaluating different marketing channels, considering factors such as target audience, budget constraints, and ROI. They should mention specific examples of channels considered and how they weighed the pros and cons of each.",
            "criteria": "The answer should demonstrate an understanding of marketing channel selection criteria, including cost-effectiveness, target audience alignment, and measurability. The candidate should provide a structured approach to decision-making and justification for their chosen channels.",
            "category": "Project Based"
        },
        {
            "id": "2",
            "question": "In your Portfolio Management Theory project, you mentioned using KNN for stock clustering. Explain how you determined the optimal 'K' value, considering the trade-off between bias and variance in the context of stock data, and what challenges did you face?",
            "template": "The candidate should discuss methods for selecting the optimal K, such as cross-validation or elbow method. They should explain the impact of K on bias and variance and discuss the specific challenges of applying KNN to stock data, such as feature scaling, distance metric selection, and the curse of dimensionality.",
            "criteria": "The answer should demonstrate a solid understanding of KNN, its parameters, and limitations. The candidate should articulate the process of hyperparameter tuning and its relevance to achieving good model performance in a financial context.",
            "category": "Project Based"
        },
        {
            "id": "3",
            "question": "In your Impact Assessment project, you used the OECD DAC framework. How did you adapt the generic OECD DAC criteria to suit the specific context and goals of the non-profit organization you were assisting, and what modifications were necessary?",
            "template": "The candidate should explain how they tailored the OECD DAC criteria (relevance, effectiveness, efficiency, impact, and sustainability) to the specific non-profit. They should provide concrete examples of adaptations made to indicators or data collection methods to better reflect the organization's mission and operating environment. They should also discuss any challenges encountered and how they were addressed.",
            "criteria": "The answer should show a deep understanding of the OECD DAC framework and the ability to apply it flexibly in different contexts. The candidate should demonstrate critical thinking skills by identifying the need for adaptation and providing well-reasoned justifications for their modifications.",
            "category": "Project Based"
        },
        {
            "id": "4",
            "question": "You spearheaded client acquisition for the APAC region at 180 Degrees Consulting. Describe a specific instance where a traditional sales strategy failed, and how you pivoted to a different approach, incorporating market analysis insights, to successfully convert a lead.",
            "template": "The candidate should detail a specific instance, outlining the initial strategy, the reasons for its failure (backed by market analysis data), the revised approach (explaining the rationale behind it), and the eventual successful conversion. They should highlight the role of market analysis in informing the pivot and quantifying the positive impact.",
            "criteria": "The answer should demonstrate practical experience in client acquisition, adaptability, and a data-driven approach to sales. The candidate should be able to clearly articulate the problem, the solution, and the results, showcasing their problem-solving and analytical skills.",
            "category": "Project Based"
        },
        {
            "id": "5",
            "question": "During your Pay-3 internship, you worked on improving the account recovery process. Assuming Pay-3 is facing a high rate of fraudulent account recovery attempts, how would you design an A/B test to evaluate the effectiveness of a new multi-factor authentication (MFA) method in reducing fraud while minimizing user friction? Detail specific metrics and statistical considerations.",
            "template": "The candidate should describe a properly designed A/B test, including control and treatment groups, sample size calculation, key metrics (e.g., fraudulent recovery attempts, successful authentications, user abandonment rate), and statistical significance testing (e.g., p-value threshold). They should also address potential biases and confounding factors and discuss strategies to mitigate them.",
            "criteria": "The answer should demonstrate a strong understanding of experimental design, statistical analysis, and user experience principles. The candidate should be able to apply these concepts to a real-world business problem and provide a clear and actionable plan for evaluating the effectiveness of the new MFA method.",
            "category": "Project Based"
        },
        {
            "id": "6",
            "question": "Explain how Porter's Five Forces framework can be used to develop a go-to-market strategy.",
            "template": "The candidate should explain each of the five forces (Threat of New Entrants, Bargaining Power of Suppliers, Bargaining Power of Buyers, Threat of Substitute Products or Services, Competitive Rivalry) and how understanding them helps to identify opportunities and threats, ultimately informing decisions about target market, value proposition, pricing, distribution, and marketing channels.",
            "criteria": "The answer should demonstrate a clear understanding of each of Porter's Five Forces and how they collectively influence industry attractiveness and profitability. The candidate should articulate how this framework directly informs strategic decisions within a go-to-market strategy, providing specific examples of how each force might impact a particular aspect of the strategy.",
            "category": "Theory Based"
        },
        {
            "id": "7",
            "question": "What is the role of risk-return tradeoff in constructing an optimal diversified portfolio using Modern Portfolio Theory (MPT)?",
            "template": "The candidate should explain that MPT aims to maximize portfolio return for a given level of risk or minimize risk for a given level of return. The risk-return tradeoff is the fundamental concept that higher potential returns typically come with higher risk. Diversification, as proposed by MPT, helps in managing this tradeoff by allocating investments across different assets with varying risk and return profiles.",
            "criteria": "The answer should clearly define the risk-return tradeoff and its significance in the context of MPT. The candidate should be able to articulate how diversification helps to balance risk and return, and how portfolio optimization techniques (like finding the efficient frontier) are used to construct a portfolio that aligns with an investor's risk tolerance.",
            "category": "Theory Based"
        },
        {
            "id": "8",
            "question": "Describe how the OECD DAC criteria and the Logical Framework Approach (LFA) can be used together to create a robust Impact Assessment system for a non-profit organization.",
            "template": "The candidate should explain that the OECD DAC criteria (relevance, effectiveness, efficiency, impact, and sustainability) provide a set of principles for evaluating development interventions. The LFA (Logical Framework Approach) is a project management tool that helps to plan, monitor, and evaluate projects by defining goals, objectives, indicators, and assumptions. They should illustrate how LFA can be structured according to the OECD DAC criteria.",
            "criteria": "The answer should demonstrate an understanding of both the OECD DAC criteria and the LFA framework. The candidate should be able to explain how the LFA can be used to operationalize the OECD DAC criteria by providing a structured approach to defining and measuring impact, ensuring that the assessment is comprehensive and aligned with international standards for development effectiveness.",
            "category": "Theory Based"
        },
        {
            "id": "9",
            "question": "Describe a situation where you used financial modeling to inform a strategic decision. What key assumptions did you make, and how did you validate them?",
            "template": "The candidate should describe a project, ideally from their Portfolio Management Theory project or case competition experience, where they built a financial model. They should explain the purpose of the model, the key inputs and assumptions (e.g., growth rates, discount rates, market size), and how they tested the sensitivity of their results to changes in these assumptions (e.g., sensitivity analysis, scenario planning). They should also discuss how the model's output influenced the final strategic recommendation.",
            "criteria": "The answer should demonstrate a clear understanding of financial modeling principles, the ability to make reasonable assumptions, and the awareness of the limitations of models. Strong candidates will highlight how they communicated the model's findings to stakeholders and used the model to drive decision-making.",
            "category": "Skill Based"
        },
        {
            "id": "10",
            "question": "Walk me through a time you used data analysis to solve a business problem. What tools did you use, and what were the key insights you derived?",
            "template": "The candidate should describe a situation where they used data analysis (potentially using SQL, Machine Learning, or Excel) to address a specific business challenge. They should detail the data sources, the tools they employed (e.g., SQL for data extraction, Python for analysis, Tableau for visualization), the analytical techniques they used (e.g., regression analysis, clustering), and the actionable insights they uncovered. The example should highlight the impact of their analysis on business outcomes.",
            "criteria": "The answer should demonstrate proficiency in data analysis techniques and tools, as well as the ability to translate data insights into practical recommendations. Bonus points for explaining how the analysis influenced stakeholder decisions and led to tangible improvements.",
            "category": "Skill Based"
        },
        {
            "id": "11",
            "question": "Explain your understanding of a Go-to-Market strategy. Can you describe a situation where you contributed to developing or executing one?",
            "template": "The candidate should define a Go-to-Market (GTM) strategy and its importance. Ideally, they would describe their role in a specific GTM initiative, outlining the target market, value proposition, marketing channels, sales strategy, and customer success plan. They should explain how they contributed to the GTM strategy, whether through market research, competitive analysis, pricing strategy, or implementation.",
            "criteria": "The answer should reveal a clear understanding of GTM principles and the candidate's ability to think strategically about how to bring a product or service to market. Stronger candidates will have contributed to multiple facets of a GTM strategy or can speak to the results of a GTM implementation they were involved in.",
            "category": "Skill Based"
        },
        {
            "id": "12",
            "question": "Describe your experience with stakeholder management, particularly in a situation with conflicting priorities. How did you navigate the situation and achieve a positive outcome?",
            "template": "The candidate should provide a specific example where they had to manage stakeholders with different needs, expectations, or priorities. They should explain how they identified the stakeholders, understood their perspectives, facilitated communication, and negotiated a solution that addressed the key concerns. This could involve client interactions, collaborations with guest speakers, or working with alumni.",
            "criteria": "The answer should showcase strong interpersonal and communication skills, as well as the ability to influence and persuade stakeholders. The candidate should demonstrate empathy, diplomacy, and a focus on building consensus.",
            "category": "Skill Based"
        },
        {
            "id": "13",
            "question": "How familiar are you with common consulting frameworks (e.g., McKinsey 7S, Value Chain Analysis)? Describe a time you applied one of these frameworks to a business problem.",
            "template": "The candidate should demonstrate familiarity with several consulting frameworks. They should describe a situation where they applied a specific framework (e.g., McKinsey 7S to assess organizational effectiveness, Value Chain Analysis to identify cost optimization opportunities). They should explain how they used the framework to structure their analysis, identify key issues, and develop recommendations.",
            "criteria": "The answer should reveal a strong understanding of the purpose and application of common consulting frameworks. Stronger candidates will have used these frameworks effectively to solve real-world business problems and can articulate the benefits of using a structured approach.",
            "category": "Skill Based"
        },
        {
            "id": "14",
            "question": "Let's say a client is facing declining market share. How would you approach a market analysis to identify the root causes and recommend potential solutions?",
            "template": "The candidate should outline a structured approach to market analysis, including steps like defining the market, analyzing market trends (e.g., growth rate, competitive landscape, regulatory environment), identifying key customer segments, and assessing the client's competitive position. They should also mention potential data sources (e.g., industry reports, market research, customer surveys) and analytical techniques (e.g., SWOT analysis, Porter's Five Forces).",
            "criteria": "The answer should demonstrate a strong understanding of market analysis principles and methodologies. The candidate should be able to articulate a clear and logical approach, as well as identify potential challenges and limitations.",
            "category": "Skill Based"
        },
        {
            "id": "15",
            "question": "You are presenting complex data to a client. How would you ensure they understand your findings and recommendations effectively?",
            "template": "The candidate should emphasize the importance of clear and concise communication, using visual aids (e.g., charts, graphs) to illustrate key points. They should also mention tailoring the presentation to the audience's level of understanding, avoiding jargon, and providing context for the data. They should also be prepared to answer questions and address concerns.",
            "criteria": "The answer should showcase strong presentation and communication skills, as well as the ability to translate complex information into actionable insights. The candidate should demonstrate empathy and a focus on building rapport with the client.",
            "category": "Skill Based"
        },
        {
            "id": "16",
            "question": "Describe a situation where you had to lead a team to achieve a challenging goal. What leadership skills did you utilize, and how did you motivate your team?",
            "template": "The candidate should provide a specific example where they demonstrated leadership skills (e.g., setting clear goals, delegating tasks, providing feedback, resolving conflicts). They should explain how they motivated their team (e.g., recognizing achievements, fostering a collaborative environment, providing opportunities for growth).",
            "criteria": "The answer should reveal the candidate's leadership style and their ability to inspire and guide a team to success. The candidate should demonstrate self-awareness and a willingness to learn from their experiences.",
            "category": "Skill Based"
        },
        {
            "id": "17",
            "question": "Explain your understanding of benchmarking. How can it be used to improve a company's performance?",
            "template": "The candidate should define benchmarking and explain its purpose. They should describe different types of benchmarking (e.g., internal, competitive, best-in-class) and how it can be used to identify areas for improvement. The answer should also cover the process of benchmarking, including identifying key metrics, selecting benchmark companies, collecting data, and analyzing the results.",
            "criteria": "The answer should demonstrate a solid understanding of benchmarking principles and methodologies. Stronger candidates will have used benchmarking to drive tangible improvements in a company's performance.",
            "category": "Skill Based"
        },
        {
            "id": "18",
            "question": "Let's say you're working on a project and facing a significant roadblock. How would you approach the problem-solving process to find a solution?",
            "template": "The candidate should outline a structured approach to problem-solving, including steps like defining the problem, gathering information, generating alternative solutions, evaluating the alternatives, selecting the best solution, and implementing it. They should also mention the importance of collaboration and seeking input from others.",
            "criteria": "The answer should demonstrate a logical and systematic approach to problem-solving. The candidate should be able to articulate a clear and concise plan, as well as identify potential challenges and risks.",
            "category": "Skill Based"
        },
        {
            "id": "19",
            "question": "During your time as Growth Coordinator at 180 Degrees Consulting NITK, you spearheaded the client acquisition process for the APAC region. Imagine you secured a potentially high-value client, but during the initial consultation, you discover their project goals are misaligned with the core competencies of your consulting group and that you are going to have to turn them down. How would you communicate this to the client, ensuring you maintain a positive relationship and leave a good impression for potential future collaborations?",
            "template": "The candidate should demonstrate an understanding of client relationship management and ethical considerations. The expected approach would involve:\n\n1.  Expressing gratitude for the client's interest and time.\n2.  Clearly and honestly explaining the misalignment between the client's needs and the consulting group's expertise.\n3.  Suggesting alternative solutions or resources, such as referring them to other consulting firms that may be a better fit.\n4.  Reiterating a commitment to maintaining a positive relationship and offering assistance in the future.\n5.  Maintaining a professional and respectful tone throughout the communication.",
            "criteria": "The answer should be judged based on the following criteria:\n\n*   **Diplomacy and Tact:** How well the candidate handles the sensitive situation of turning down a client while preserving the relationship.\n*   **Communication Skills:** Clarity, professionalism, and empathy in their proposed communication strategy.\n*   **Problem-Solving:** The ability to offer alternative solutions or resources to the client.\n*   **Ethical Considerations:** Recognition of the importance of aligning projects with core competencies and avoiding over-promising.\n*   **Client-Focus:** Demonstrating a genuine interest in helping the client, even if it means referring them elsewhere.",
            "category": "Situation Based"
        },
        {
            "id": "20",
            "question": "You mentioned your role as a Project Manager for the Go-to-Market Strategy project at 180 Degrees Consulting NITK, where you led a team of 8 consultants. Suppose one of your team members consistently misses deadlines and delivers subpar work, negatively impacting the project's progress. How would you address this situation, ensuring you maintain team morale and still complete the project successfully and on time?",
            "template": "The candidate should demonstrate leadership, conflict resolution, and performance management skills. The expected approach would involve:\n\n1.  Addressing the issue privately with the team member, focusing on specific instances of missed deadlines and subpar work.\n2.  Attempting to understand the underlying reasons for the performance issues (e.g., lack of skills, time management problems, personal challenges).\n3.  Providing constructive feedback and offering support, such as additional training or mentorship.\n4.  Collaboratively setting clear expectations and timelines for improvement.\n5.  Documenting the performance issues and the agreed-upon improvement plan.\n6.  Monitoring the team member's progress and providing regular feedback.\n7.  Escalating the issue to a supervisor or HR if the performance does not improve despite the support and interventions.",
            "criteria": "The answer should be judged based on the following criteria:\n\n*   **Leadership Skills:** The ability to address performance issues proactively and constructively.\n*   **Conflict Resolution:** The ability to handle difficult conversations and find mutually agreeable solutions.\n*   **Communication Skills:** Clarity, empathy, and professionalism in their approach.\n*   **Performance Management:** Understanding of the steps involved in addressing and improving employee performance.\n*   **Teamwork:** The ability to balance individual needs with the overall project goals and team morale.\n*   **Problem-Solving:** Developing a plan to address the situation while ensuring project success and timely completion.",
            "category": "Situation Based"
        }
    ]
}