{
    "questions": [
        {
            "id": "1",
            "question": "Describe a time you had to navigate conflicting interests between project stakeholders. How did you identify the root causes of the conflict, and what specific strategies did you use to build consensus and ensure project success, detailing the communication techniques employed and their effectiveness?",
            "template": "The candidate should describe a specific situation, outlining the stakeholders involved, their differing interests, and the potential impact on the project. They should then detail the methods used to identify the root causes of the conflict (e.g., active listening, facilitated discussions, data analysis) and the strategies employed to build consensus (e.g., negotiation, compromise, mediation). They should clearly articulate the communication techniques used (e.g., one-on-one meetings, group workshops, written communication) and provide a candid assessment of their effectiveness. The answer should highlight their ability to understand diverse perspectives, build trust, and facilitate collaborative problem-solving.",
            "criteria": "The answer should demonstrate a clear understanding of stakeholder management principles and conflict resolution techniques. The candidate should provide a detailed and specific example, illustrating their ability to analyze complex situations, develop and implement effective strategies, and communicate clearly and persuasively. The assessment will focus on the depth of their understanding, the practicality of their approach, and the demonstrable impact of their actions.",
            "category": "Project Based"
        },
        {
            "id": "2",
            "question": "Walk me through a scenario where your market entry strategy was based on indirect channel partnerships. Explain the specific process you undertook to assess potential partners, what selection criteria did you use, and how did you mitigate possible risks stemming from misaligned goals or lack of control over the partner's sales process. What kind of agreement/contractual obligations did you create?",
            "template": "The candidate should describe a situation where an indirect channel strategy was crucial for market entry. They should detail the process of identifying and evaluating potential partners, including the specific criteria used (e.g., market reach, industry expertise, financial stability, cultural alignment). The candidate should then explain how they mitigated risks associated with channel partnerships, such as misaligned goals or lack of control over the sales process. This explanation should include examples of specific strategies used, such as clearly defined partnership agreements, performance-based incentives, and regular communication and monitoring. The answer should also cover the contractual obligations and legal aspects considered.",
            "criteria": "The answer should demonstrate a strong understanding of indirect channel strategies and the associated risks and challenges. The candidate should provide a detailed and practical account of their experience, highlighting their ability to identify and evaluate potential partners, mitigate risks, and manage relationships effectively. The answer should showcase strategic thinking, risk assessment skills, and relationship management expertise.",
            "category": "Project Based"
        },
        {
            "id": "3",
            "question": "Describe a situation where you were managing a project utilizing the Logical Framework Approach (LFA). Elaborate on how you specifically defined the intervention logic (i.e., the causal links between activities, outputs, outcomes, and impact). What methods did you use to ensure that your indicators were SMART (Specific, Measurable, Achievable, Relevant, Time-bound) and how did you incorporate feedback loops for adaptive management during the project lifecycle?",
            "template": "The candidate should thoroughly describe a project using LFA, detailing the process of defining the intervention logic, including defining activities, outputs, outcomes, and impact. They should give specific examples of how they ensured that the indicators used to track progress were SMART, and explain the methods used to measure those indicators. A crucial element of the response is a description of the feedback mechanisms incorporated into the project design to allow for adaptive management and how these mechanisms were actually used to modify the project plan. The answer should also include the process of creating the logframe matrix and how stakeholders were involved. The candidate should specifically describe how the logframe was utilized throughout the project lifecycle.",
            "criteria": "The response should showcase a deep understanding of the LFA framework and its practical application in project management. Key evaluation criteria include the clarity and coherence of the described intervention logic, the appropriateness of the selected indicators, and the effectiveness of the feedback mechanisms used for adaptive management. Bonus points for describing challenges implementing the LFA and the process for course-correcting.",
            "category": "Project Based"
        },
        {
            "id": "4",
            "question": "You are tasked with improving a client's operational efficiency using benchmarking. Detail your process for selecting relevant companies for benchmarking, including the key performance indicators (KPIs) you would prioritize. Discuss specific methods for collecting and validating benchmarking data (e.g., publicly available reports, primary research) and how you would normalize the data to account for differences in scale and business models.",
            "template": "The candidate should present a structured approach for selecting relevant companies for benchmarking, including the criteria used for selection and the rationale behind prioritizing specific KPIs (e.g., cost efficiency, productivity, customer satisfaction). They should describe the methods they would use to collect benchmarking data, emphasizing the importance of data validation and reliability. The candidate should also explain how they would normalize the data to account for differences in scale and business models, providing specific examples of normalization techniques (e.g., ratio analysis, statistical adjustments). Discuss the ethical considerations associated with data collection and dissemination.",
            "criteria": "The answer should demonstrate a strong understanding of benchmarking principles and best practices. The candidate should provide a clear and practical framework for selecting benchmark companies, collecting and validating data, and normalizing the data for meaningful comparisons. The evaluation will focus on the candidate's analytical skills, attention to detail, and ability to apply benchmarking techniques to improve operational efficiency, as well as their understanding of ethical and legal considerations.",
            "category": "Project Based"
        },
        {
            "id": "5",
            "question": "Imagine you're working with a non-profit that is aiming to increase its funding via grants. Develop a detailed strategy for identifying the relevant OECD DAC criteria for evaluating the non-profit's specific programs and demonstrate how those criteria can be translated into compelling narratives and measurable indicators for a grant proposal to attract more funding.",
            "template": "The candidate should identify the relevant OECD DAC criteria (Relevance, Effectiveness, Efficiency, Impact, and Sustainability) and specifically explain how each criterion applies to the non-profit's programs, giving examples based on a hypothetical program the interviewer presents or one of their choosing. Then, they should translate these criteria into compelling narratives, e.g., by constructing a Theory of Change, showing the logical pathways from inputs to activities, outputs, outcomes, and impact. Finally, they should describe the process of turning these narratives into SMART (Specific, Measurable, Achievable, Relevant, and Time-bound) indicators to assess the program's performance within the grant proposal. The strategy should also consider strategies for tailoring narratives to specific funders' priorities.",
            "criteria": "The answer should demonstrate a deep understanding of the OECD DAC criteria and their application in the context of grant writing. Evaluate the ability to translate abstract criteria into concrete narratives and measurable indicators, demonstrating a practical approach for attracting grant funding. The candidate's strategic thinking, storytelling abilities, and understanding of donor preferences will be assessed.",
            "category": "Project Based"
        },
        {
            "id": "6",
            "question": "Kunaal, your resume mentions your role as Growth Coordinator at 180 Degrees Consulting NITK, where you spearheaded client acquisition for the APAC region. Can you elaborate on a specific challenge you faced in converting an overseas lead, and how did you overcome it?",
            "template": "The candidate should describe a specific situation where they faced a challenge in converting an overseas lead. They should clearly articulate the challenge, the steps they took to address it, the resources they utilized, and the outcome of their efforts. The response should demonstrate their problem-solving skills, cultural sensitivity, communication skills, and ability to navigate complex situations.",
            "criteria": "The answer will be judged based on the clarity and specificity of the example provided, the relevance of the challenges described to international client acquisition, the candidate's problem-solving approach, the demonstrated ability to learn and adapt, and the quantifiable impact of their actions. Look for evidence of initiative, resourcefulness, and effective communication. A strong answer will also reflect an understanding of cultural nuances and the importance of building strong client relationships.",
            "category": "Situational"
        },
        {
            "id": "7",
            "question": "Imagine you're tasked with leading a project for a new client in the renewable energy sector. The client has conflicting internal stakeholders, each with different priorities and expectations. How would you approach managing these diverse perspectives to ensure a successful project outcome?",
            "template": "The candidate should outline a structured approach to managing the conflicting stakeholder priorities. This should include identifying key stakeholders, understanding their individual perspectives and priorities, facilitating communication and collaboration, and developing a plan that addresses the core needs of the client while considering the concerns of all stakeholders. The response should also demonstrate their ability to negotiate, compromise, and build consensus.",
            "criteria": "The answer will be judged based on the candidate's demonstrated understanding of stakeholder management principles, their ability to develop a structured and practical approach, their communication and interpersonal skills, and their ability to navigate complex and politically sensitive situations. Look for evidence of empathy, active listening, and a results-oriented mindset. A strong answer will also highlight the importance of clear communication, transparency, and proactive risk management.",
            "category": "Situational"
        }
    ]
}