{
    "questions": [
        {
            "id": "1",
            "question": "Explain how the 'Threat of New Entrants', as defined in Porter's Five Forces framework, can impact the 'Intensity of Competitive Rivalry' within a market.",
            "template": "The candidate should first define 'Threat of New Entrants' as the ease with which new competitors can enter a market and then define 'Intensity of Competitive Rivalry' as the level of competition among existing players. They should then explain that a higher threat of new entrants can intensify competitive rivalry as existing firms may lower prices or increase marketing spending to deter new firms. Conversely, strong barriers to entry can lead to less intense rivalry as firms face fewer new competitors.",
            "criteria": "The response should clearly define both sub-concepts. The explanation should logically link how new entrants influence the behavior of existing firms, and should illustrate how low and high barriers to entry affects competition, showcasing an understanding of Porter's framework.",
            "category": "Theoretical"
        },
        {
            "id": "2",
            "question": "What is the role of 'Feature Engineering' in improving the performance of machine learning models, specifically when using 'Time Series Analysis' for predicting stock prices?",
            "template": "The candidate should first define 'Feature Engineering' as the process of selecting and transforming raw data into relevant features that a machine learning model can utilize, and ‘Time series analysis’ is a specific kind of analysis for data that is indexed by time. They should then explain how thoughtfully engineered features, such as moving averages, volatility indicators, or lag variables, derived from historical stock prices can enhance a machine learning model's ability to identify patterns and predict future prices, which improves model accuracy and robustness over using raw time series data. The candidate should also emphasize why proper feature engineering is necessary with time series data, especially for stocks because the market is not static.",
            "criteria": "The response should provide a clear definition for feature engineering and time series analysis with respect to stock prices. It should articulate how the quality of features affects model performance and demonstrates how careful selection of feature inputs improves a model’s ability to learn the underlying trends of time-series data.",
            "category": "Theoretical"
        },
        {
            "id": "3",
            "question": "Describe how a well defined 'Theory of Change' within an 'Impact Assessment System' aids in making the implementation more effective for a non-profit.",
            "template": "The candidate should define ‘Theory of Change’ as the roadmap demonstrating the steps and processes required to achieve the intended impact and ‘Impact Assessment System’ as the methods used to evaluate project's effects. They should explain that a well-defined theory of change provides a logical flow of cause-and-effect relationships that link project activities to desired outcomes and ultimate impact, guiding a non-profit by clarifying how their actions will lead to change, and thereby allow for more effective use of resources, better project design, and helps non-profits measure success better as they have clear objectives and milestones from start to end. The candidate should also state that a clear theory of change improves accountability and provides a basis for monitoring and evaluation in their assessment.",
            "criteria": "The answer should define both the concepts with respect to a non-profit setting. The explanation should clearly demonstrate how a theory of change acts as a guide for a non-profit in implementing a project and how that makes the process more effective by allowing better planning and better project monitoring.",
            "category": "Theoretical"
        },
        {
            "id": "4",
            "question": "In SQL, how would you retrieve a list of clients who have generated revenue above the average revenue of all clients, along with their specific revenue contributions?",
            "template": "The candidate should demonstrate proficiency in SQL by using a subquery to calculate the average revenue and then filtering clients based on this average. This involves using aggregate functions like AVG() and a WHERE clause with a subquery. They should also be able to present the required columns such as client id and revenue.",
            "criteria": "The candidate must provide a syntactically correct SQL query. The query should accurately identify clients with revenue above the average and display both the client identifier and their specific revenue amount. The candidate should correctly use aggregate functions and subqueries.",
            "category": "Technical Skills"
        },
        {
            "id": "5",
            "question": "Describe the process and logic behind creating a dynamic pivot table in Excel that automatically updates when new data is added to the source data.",
            "template": "The candidate should discuss the use of named ranges, tables and dynamic data sources when creating pivot tables in Excel. They should elaborate on the method of creating a pivot table with dynamic range and the advantages it provides, especially when the source data changes. They must show understanding of the mechanics behind dynamically updating a pivot table.",
            "criteria": "The answer should accurately identify the steps for creating a dynamic pivot table and should highlight the appropriate use of either tables or named ranges. The candidate should also mention the refresh mechanism in the pivot table and how it reflects changes to source data. A clear understanding of dynamic data ranges is critical.",
            "category": "Technical Skills"
        },
        {
            "id": "6",
            "question": "Explain the practical application of VLOOKUP, or similar lookup functions in Excel, within the context of a market analysis project.",
            "template": "The candidate should provide a practical example of how VLOOKUP (or similar functions like INDEX-MATCH) can be used in a market analysis project such as fetching market size of a segment from a different excel sheet. They should explain the arguments of the VLOOKUP function (lookup_value, table_array, col_index_num, range_lookup). Furthermore, they should discuss the limitations of using VLOOKUP and when to use other alternatives.",
            "criteria": "The candidate must clearly explain the arguments and usage of VLOOKUP or similar functions. The explanation should be relevant to a market analysis context and demonstrate understanding of the specific function's capabilities, including when to use the exact or approximate match parameter.",
            "category": "Technical Skills"
        },
        {
            "id": "7",
            "question": "How would you use SQL to identify the top 10 performing projects based on a specific metric like 'impact score', from a database table containing project data?",
            "template": "The candidate should describe how to use a combination of ORDER BY and LIMIT clauses in SQL to identify the top N projects. They should clarify the usage of ORDER BY in descending order and using LIMIT to get the top 10 performing projects based on 'impact score'. The query should include relevant project details along with the impact score.",
            "criteria": "The candidate should provide a syntactically correct SQL query that uses ORDER BY in descending order and LIMIT clause. The query should fetch top 10 projects and correctly sort projects based on a defined impact score in descending order. Their explanation should indicate an understanding of how to retrieve top results from a dataset.",
            "category": "Technical Skills"
        },
        {
            "id": "8",
            "question": "Describe a scenario where you would use SQL's JOIN operations to combine data from multiple tables to create a comprehensive view for a client engagement.",
            "template": "The candidate should describe a scenario involving multiple tables and explain the need for joining data. They should illustrate how different types of JOINs (INNER, LEFT, RIGHT, FULL) would be used based on the desired outcome and data relationships. The explanation should provide an example involving clients, projects, and engagement data. It should also demonstrate understanding of when to use each type of JOIN. ",
            "criteria": "The candidate should clearly demonstrate understanding of different types of SQL JOIN operations by providing a practical business-related example. They should correctly use the terminologies related to JOIN clauses and provide rationale for using different types of JOINs based on the requirement.",
            "category": "Technical Skills"
        },
        {
            "id": "9",
            "question": "What is the function of ‘self’ in Python, and how does it relate to object-oriented programming principles?",
            "template": "The candidate should explain that 'self' is a reference to the instance of a class and is used to access attributes and methods of the object within a class. They should discuss how this relates to object-oriented programming concepts like encapsulation and how using 'self' facilitates managing the data related to an object. They must also differentiate using 'self' from not using it.",
            "criteria": "The candidate should provide a clear explanation of the function of 'self' in Python classes and its importance in managing object states. The candidate should also demonstrate an understanding of encapsulation and that every method of a class has self as its first parameter.",
            "category": "Technical Skills"
        },
        {
            "id": "10",
            "question": "How can you use Python to read data from a CSV file and perform preliminary data cleaning and analysis, such as removing rows with missing values or calculating summary statistics?",
            "template": "The candidate should explain the steps, using libraries such as pandas to load data, identify and handle missing values (using methods such as dropna or fillna), and perform basic analysis such as calculating mean, median, mode, and other statistics. The explanation should include specific code implementations for the steps mentioned. They should discuss the reasoning behind using relevant pandas methods.",
            "criteria": "The candidate should describe the process with steps and with specific code implementations related to it. They should showcase the knowledge of using pandas library for handling CSV data, cleaning it and performing basic data analysis. The code should demonstrate a clear understanding of removing missing values and calculating statistics.",
            "category": "Technical Skills"
        },
        {
            "id": "11",
            "question": "Given a dataset of client engagements, how would you use Python (with pandas) to identify clients who have had engagements across multiple project types?",
            "template": "The candidate should explain the use of the pandas library for loading and manipulating data. They should discuss how to group data by client and then count the unique project types associated with each client. They should demonstrate their understanding of identifying clients with multiple engagements and mention the use of ‘groupby’ and ‘nunique’ methods. They should also discuss the relevant steps in pandas that can be used for performing this analysis.",
            "criteria": "The candidate must provide a method to identify clients with multiple project types using Python and pandas. The approach should demonstrate data grouping, counting unique values, and filtering based on that count. They should also explain their steps in detail and the correct usage of required pandas methods.",
            "category": "Technical Skills"
        },
        {
            "id": "12",
            "question": "In Power BI, explain your approach to designing a dashboard to visualize key performance indicators (KPIs) for project delivery, considering the needs of both executive and operational stakeholders?",
            "template": "The candidate should describe how to design a dashboard with different levels of details for different stakeholders, with high-level KPIs for executives and detailed breakdowns for operations teams. They should discuss the use of relevant visualizations for each audience and ensuring that the dashboard is interactive. The response should cover considerations such as clarity, interactivity, and appropriate data display.",
            "criteria": "The candidate should demonstrate a strong understanding of designing user-centric Power BI dashboards. The explanation should cover different types of charts and visualizations to be used for different purposes, the use of filters and slicers for interactivity, and how to present both summarized and detailed information effectively. They should also mention the thought process behind making a user friendly dashboard.",
            "category": "Technical Skills"
        },
        {
            "id": "13",
            "question": "How would you approach a scenario where a Power BI report is performing slowly, and what steps would you take to optimize its performance?",
            "template": "The candidate should discuss common reasons for slow performance, including inefficient DAX calculations, suboptimal data modeling, unnecessary complexity and excessive data. They should then describe steps they would take, such as optimizing DAX queries, simplifying data model, using import mode instead of direct query, reducing the volume of data, and using query folding. They should discuss ways to identify the bottleneck and methods to solve the performance issues. ",
            "criteria": "The candidate should be able to identify the common causes of slow performance in Power BI reports and provide specific methods to resolve them, including optimizing DAX, data models, and data loading methods. The answer should showcase the knowledge of best practices and ability to perform root cause analysis of the performance issue and provide relevant fixes.",
            "category": "Technical Skills"
        },
        {
            "id": "14",
            "question": "In your role as Project Manager for the Go-to-Market Strategy project at 180 Degrees Consulting, you mentioned assisting in raising $1.5 million in investments and grants. Describe a situation where you encountered a significant hurdle in securing funding or investor buy-in, and how you adapted your strategy to overcome this.",
            "template": "The candidate should discuss a specific challenge faced during the fundraising process, such as a skeptical investor, a lack of initial interest, or a change in market conditions. The candidate should clearly explain their actions, the rationale behind them, and how they adapted their approach to address the obstacle. They should highlight the steps they took, the resources they used, the stakeholders they involved and their specific contribution. They should demonstrate problem solving, adaptability, and strategic thinking. It is important to see how they approached the situation and the end result, even if the result was negative. The candidate should show an ability to learn from failures. The candidate should also highlight the data or insights they gathered and used to take an action. ",
            "criteria": "The response should demonstrate a clear understanding of the challenges in fundraising. The candidate should present a structured and coherent narrative outlining the situation, their actions, and the outcome. The response should highlight specific strategies, insights, and resources used to overcome the hurdles. The candidate's actions should demonstrate a proactive approach to problem-solving and demonstrate adaptability. There should be a clear articulation of the learning from the situation. The impact of the strategy and the overall outcome should be clear.",
            "category": "Situational"
        },
        {
            "id": "15",
            "question": "Imagine you're working on a critical project with a tight deadline, and you realize your team member is consistently missing deadlines. How would you approach this situation to get the project back on track without jeopardizing team morale or the project's overall objectives?",
            "template": "The candidate should outline a structured approach that prioritizes open communication, problem-solving, and maintaining team cohesion. They should discuss their willingness to understand the root cause behind the missed deadlines—it could be lack of resources, training, skills, understanding of the task, or any personal reason. They should explain how they would initiate a conversation to discuss the concerns while remaining empathetic and respectful, rather than accusatory or judgmental. The candidate should talk about collaborating with the team member to create a plan to rectify the situation. This may include helping them plan out or breaking down the task into smaller parts. They should demonstrate problem solving, and team management skills. The candidate should also talk about establishing clear expectations and support mechanisms while keeping overall objectives in mind. The response should also address the importance of having a clear conversation about the impact of missed deadlines on the overall project.",
            "criteria": "The answer should showcase effective communication and interpersonal skills and the candidate's ability to understand the perspectives of others involved. The candidate should be able to effectively highlight the steps and actions that ensure the project gets back on track. They should demonstrate a balanced approach that prioritizes both the needs of the project and team members. The response should showcase leadership qualities and an understanding of how to manage performance issues while maintaining team morale. The response should focus on the importance of deadlines and the project's overall goals, rather than solely focusing on individual performance, and demonstrate proactive solutions to get the project back on track. ",
            "category": "Situational"
        }
    ]
}